dog-grooming-backend/app/controllers/api/g1/groomers_controller.rb

    def index
        @groomers = Groomer.all
---
SELECT "groomers".* FROM "groomers"

    def show
        @groomer = Groomer.find(params[:id])
---
SELECT "groomers".* FROM "groomers" WHERE "groomers"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]