dog-grooming-backend/app/controllers/api/g1/users_controller.rb

    def index
        @users = User.all
---
SELECT "users".* FROM "users"

    def create
        # binding.pry
        @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "fabi "], ["last_name", "lauff"], ["created_at", "2020-02-28 19:41:55.701780"], ["updated_at", "2020-02-28 19:41:55.701780"]]